3.BoundaryLayer/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 300;

boundaryField
{
    inlet
    {
        type            fixedValue;
		value			uniform 300;
    }

    outlet
    {
        type            zeroGradient;
    }

    plate
    {
        type            fixedValue;
		value			uniform 355;
    }

    symmTop
    {
        type            symmetryPlane;
    }
    symmBottom
    {
        type            symmetryPlane;
    }
	

}

// ************************************************************************* //
