3.BoundaryLayer/0/wallShearStress
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      wallShearStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    outlet
    {
        type            calculated;
        value           uniform (0 0 0);
    }
    plate
    {
        type            calculated;
        value           nonuniform List<vector> 
220
(
(-1.4897 0 0)
(-1.4897 0 0)
(-1.4897 0 0)
(-1.4897 0 0)
(-1.4897 0 0)
(-1.4897 0 0)
(-1.4897 0 0)
(-1.4897 0 0)
...
)
;
    }
    symmTop
    {
        type            symmetryPlane;
    }
    symmBottom
    {
        type            symmetryPlane;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
